{"object_name_to_idx": {"person": 1, "bicycle": 2, "car": 3, "motorcycle": 4, "airplane": 5, "bus": 6, "train": 7, "truck": 8, "boat": 9, "traffic light": 10, "fire hydrant": 11, "stop sign": 13, "parking meter": 14, "bench": 15, "bird": 16, "cat": 17, "dog": 18, "horse": 19, "sheep": 20, "cow": 21, "elephant": 22, "bear": 23, "zebra": 24, "giraffe": 25, "backpack": 27, "umbrella": 28, "handbag": 31, "tie": 32, "suitcase": 33, "frisbee": 34, "skis": 35, "snowboard": 36, "sports ball": 37, "kite": 38, "baseball bat": 39, "baseball glove": 40, "skateboard": 41, "surfboard": 42, "tennis racket": 43, "bottle": 44, "wine glass": 46, "cup": 47, "fork": 48, "knife": 49, "spoon": 50, "bowl": 51, "banana": 52, "apple": 53, "sandwich": 54, "orange": 55, "broccoli": 56, "carrot": 57, "hot dog": 58, "pizza": 59, "donut": 60, "cake": 61, "chair": 62, "couch": 63, "potted plant": 64, "bed": 65, "dining table": 67, "toilet": 70, "tv": 72, "laptop": 73, "mouse": 74, "remote": 75, "keyboard": 76, "cell phone": 77, "microwave": 78, "oven": 79, "toaster": 80, "sink": 81, "refrigerator": 82, "book": 84, "clock": 85, "vase": 86, "scissors": 87, "teddy bear": 88, "hair drier": 89, "toothbrush": 90, "banner": 92, "blanket": 93, "branch": 94, "bridge": 95, "building-other": 96, "bush": 97, "cabinet": 98, "cage": 99, "cardboard": 100, "carpet": 101, "ceiling-other": 102, "ceiling-tile": 103, "cloth": 104, "clothes": 105, "clouds": 106, "counter": 107, "cupboard": 108, "curtain": 109, "desk-stuff": 110, "dirt": 111, "door-stuff": 112, "fence": 113, "floor-marble": 114, "floor-other": 115, "floor-stone": 116, "floor-tile": 117, "floor-wood": 118, "flower": 119, "fog": 120, "food-other": 121, "fruit": 122, "furniture-other": 123, "grass": 124, "gravel": 125, "ground-other": 126, "hill": 127, "house": 128, "leaves": 129, "light": 130, "mat": 131, "metal": 132, "mirror-stuff": 133, "moss": 134, "mountain": 135, "mud": 136, "napkin": 137, "net": 138, "paper": 139, "pavement": 140, "pillow": 141, "plant-other": 142, "plastic": 143, "platform": 144, "playingfield": 145, "railing": 146, "railroad": 147, "river": 148, "road": 149, "rock": 150, "roof": 151, "rug": 152, "salad": 153, "sand": 154, "sea": 155, "shelf": 156, "sky-other": 157, "skyscraper": 158, "snow": 159, "solid-other": 160, "stairs": 161, "stone": 162, "straw": 163, "structural-other": 164, "table": 165, "tent": 166, "textile-other": 167, "towel": 168, "tree": 169, "vegetable": 170, "wall-brick": 171, "wall-concrete": 172, "wall-other": 173, "wall-panel": 174, "wall-stone": 175, "wall-tile": 176, "wall-wood": 177, "water-other": 178, "waterdrops": 179, "window-blind": 180, "window-other": 181, "wood": 182, "other": 183, "__image__": 0}, "pred_name_to_idx": {"__in_image__": 0, "left of": 1, "right of": 2, "above": 3, "below": 4, "inside": 5, "surrounding": 6, "__has_object__": 7}, "num_attributes": 35, "instance": ["person", "bicycle", "car", "motorcycle", "airplane", "bus", "train", "truck", "boat", "traffic light", "fire hydrant", "stop sign", "parking meter", "bench", "bird", "cat", "dog", "horse", "sheep", "cow", "elephant", "bear", "zebra", "giraffe", "backpack", "umbrella", "handbag", "tie", "suitcase", "frisbee", "skis", "snowboard", "sports ball", "kite", "baseball bat", "baseball glove", "skateboard", "surfboard", "tennis racket", "bottle", "wine glass", "cup", "fork", "knife", "spoon", "bowl", "banana", "apple", "sandwich", "orange", "broccoli", "carrot", "hot dog", "pizza", "donut", "cake", "chair", "couch", "potted plant", "bed", "dining table", "toilet", "tv", "laptop", "mouse", "remote", "keyboard", "cell phone", "microwave", "oven", "toaster", "sink", "refrigerator", "book", "clock", "vase", "scissors", "teddy bear", "hair drier", "toothbrush"], "stuff": ["banner", "blanket", "branch", "bridge", "building-other", "bush", "cabinet", "cage", "cardboard", "carpet", "ceiling-other", "ceiling-tile", "cloth", "clothes", "clouds", "counter", "cupboard", "curtain", "desk-stuff", "dirt", "door-stuff", "fence", "floor-marble", "floor-other", "floor-stone", "floor-tile", "floor-wood", "flower", "fog", "food-other", "fruit", "furniture-other", "grass", "gravel", "ground-other", "hill", "house", "leaves", "light", "mat", "metal", "mirror-stuff", "moss", "mountain", "mud", "napkin", "net", "paper", "pavement", "pillow", "plant-other", "plastic", "platform", "playingfield", "railing", "railroad", "river", "road", "rock", "roof", "rug", "salad", "sand", "sea", "shelf", "sky-other", "skyscraper", "snow", "solid-other", "stairs", "stone", "straw", "structural-other", "table", "tent", "textile-other", "towel", "tree", "vegetable", "wall-brick", "wall-concrete", "wall-other", "wall-panel", "wall-stone", "wall-tile", "wall-wood", "water-other", "waterdrops", "window-blind", "window-other", "wood", "other"], "object_idx_to_name": ["__image__", "person", "bicycle", "car", "motorcycle", "airplane", "bus", "train", "truck", "boat", "traffic light", "fire hydrant", "NONE", "stop sign", "parking meter", "bench", "bird", "cat", "dog", "horse", "sheep", "cow", "elephant", "bear", "zebra", "giraffe", "NONE", "backpack", "umbrella", "NONE", "NONE", "handbag", "tie", "suitcase", "frisbee", "skis", "snowboard", "sports ball", "kite", "baseball bat", "baseball glove", "skateboard", "surfboard", "tennis racket", "bottle", "NONE", "wine glass", "cup", "fork", "knife", "spoon", "bowl", "banana", "apple", "sandwich", "orange", "broccoli", "carrot", "hot dog", "pizza", "donut", "cake", "chair", "couch", "potted plant", "bed", "NONE", "dining table", "NONE", "NONE", "toilet", "NONE", "tv", "laptop", "mouse", "remote", "keyboard", "cell phone", "microwave", "oven", "toaster", "sink", "refrigerator", "NONE", "book", "clock", "vase", "scissors", "teddy bear", "hair drier", "toothbrush", "NONE", "banner", "blanket", "branch", "bridge", "building-other", "bush", "cabinet", "cage", "cardboard", "carpet", "ceiling-other", "ceiling-tile", "cloth", "clothes", "clouds", "counter", "cupboard", "curtain", "desk-stuff", "dirt", "door-stuff", "fence", "floor-marble", "floor-other", "floor-stone", "floor-tile", "floor-wood", "flower", "fog", "food-other", "fruit", "furniture-other", "grass", "gravel", "ground-other", "hill", "house", "leaves", "light", "mat", "metal", "mirror-stuff", "moss", "mountain", "mud", "napkin", "net", "paper", "pavement", "pillow", "plant-other", "plastic", "platform", "playingfield", "railing", "railroad", "river", "road", "rock", "roof", "rug", "salad", "sand", "sea", "shelf", "sky-other", "skyscraper", "snow", "solid-other", "stairs", "stone", "straw", "structural-other", "table", "tent", "textile-other", "towel", "tree", "vegetable", "wall-brick", "wall-concrete", "wall-other", "wall-panel", "wall-stone", "wall-tile", "wall-wood", "water-other", "waterdrops", "window-blind", "window-other", "wood", "other"], "object_to_idx": {"1": 1, "2": 2, "3": 3, "4": 4, "5": 5, "6": 6, "7": 7, "8": 8, "9": 9, "10": 10, "11": 11, "13": 12, "14": 13, "15": 14, "16": 15, "17": 16, "18": 17, "19": 18, "20": 19, "21": 20, "22": 21, "23": 22, "24": 23, "25": 24, "27": 25, "28": 26, "31": 27, "32": 28, "33": 29, "34": 30, "35": 31, "36": 32, "37": 33, "38": 34, "39": 35, "40": 36, "41": 37, "42": 38, "43": 39, "44": 40, "46": 41, "47": 42, "48": 43, "49": 44, "50": 45, "51": 46, "52": 47, "53": 48, "54": 49, "55": 50, "56": 51, "57": 52, "58": 53, "59": 54, "60": 55, "61": 56, "62": 57, "63": 58, "64": 59, "65": 60, "67": 61, "70": 62, "72": 63, "73": 64, "74": 65, "75": 66, "76": 67, "77": 68, "78": 69, "79": 70, "80": 71, "81": 72, "82": 73, "84": 74, "85": 75, "86": 76, "87": 77, "88": 78, "89": 79, "90": 80, "92": 81, "93": 82, "94": 83, "95": 84, "96": 85, "97": 86, "98": 87, "99": 88, "100": 89, "101": 90, "102": 91, "103": 92, "104": 93, "105": 94, "106": 95, "107": 96, "108": 97, "109": 98, "110": 99, "111": 100, "112": 101, "113": 102, "114": 103, "115": 104, "116": 105, "117": 106, "118": 107, "119": 108, "120": 109, "121": 110, "122": 111, "123": 112, "124": 113, "125": 114, "126": 115, "127": 116, "128": 117, "129": 118, "130": 119, "131": 120, "132": 121, "133": 122, "134": 123, "135": 124, "136": 125, "137": 126, "138": 127, "139": 128, "140": 129, "141": 130, "142": 131, "143": 132, "144": 133, "145": 134, "146": 135, "147": 136, "148": 137, "149": 138, "150": 139, "151": 140, "152": 141, "153": 142, "154": 143, "155": 144, "156": 145, "157": 146, "158": 147, "159": 148, "160": 149, "161": 150, "162": 151, "163": 152, "164": 153, "165": 154, "166": 155, "167": 156, "168": 157, "169": 158, "170": 159, "171": 160, "172": 161, "173": 162, "174": 163, "175": 164, "176": 165, "177": 166, "178": 167, "179": 168, "180": 169, "181": 170, "182": 171, "0": 0}, "my_idx_to_obj": ["person", "bicycle", "car", "motorcycle", "airplane", "bus", "train", "truck", "boat", "traffic light", "fire hydrant", "stop sign", "parking meter", "bench", "bird", "cat", "dog", "horse", "sheep", "cow", "elephant", "bear", "zebra", "giraffe", "backpack", "umbrella", "handbag", "tie", "suitcase", "frisbee", "skis", "snowboard", "sports ball", "kite", "baseball bat", "baseball glove", "skateboard", "surfboard", "tennis racket", "bottle", "wine glass", "cup", "fork", "knife", "spoon", "bowl", "banana", "apple", "sandwich", "orange", "broccoli", "carrot", "hot dog", "pizza", "donut", "cake", "chair", "couch", "potted plant", "bed", "dining table", "toilet", "tv", "laptop", "mouse", "remote", "keyboard", "cell phone", "microwave", "oven", "toaster", "sink", "refrigerator", "book", "clock", "vase", "scissors", "teddy bear", "hair drier", "toothbrush", "banner", "blanket", "branch", "bridge", "building-other", "bush", "cabinet", "cage", "cardboard", "carpet", "ceiling-other", "ceiling-tile", "cloth", "clothes", "clouds", "counter", "cupboard", "curtain", "desk-stuff", "dirt", "door-stuff", "fence", "floor-marble", "floor-other", "floor-stone", "floor-tile", "floor-wood", "flower", "fog", "food-other", "fruit", "furniture-other", "grass", "gravel", "ground-other", "hill", "house", "leaves", "light", "mat", "metal", "mirror-stuff", "moss", "mountain", "mud", "napkin", "net", "paper", "pavement", "pillow", "plant-other", "plastic", "platform", "playingfield", "railing", "railroad", "river", "road", "rock", "roof", "rug", "salad", "sand", "sea", "shelf", "sky-other", "skyscraper", "snow", "solid-other", "stairs", "stone", "straw", "structural-other", "table", "tent", "textile-other", "towel", "tree", "vegetable", "wall-brick", "wall-concrete", "wall-other", "wall-panel", "wall-stone", "wall-tile", "wall-wood", "water-other", "waterdrops", "window-blind", "window-other", "wood"], "pred_idx_to_name": ["__in_image__", "left of", "right of", "above", "below", "inside", "surrounding", "__has_object__"]}
