{"object_name_to_idx": {"__image__": 0, "man": 1, "shirt": 2, "person": 3, "sign": 4, "head": 5, "leg": 6, "hand": 7, "hair": 8, "car": 9, "woman": 10, "ear": 11, "eye": 12, "line": 13, "shoe": 14, "door": 15, "wheel": 16, "letter": 17, "pant": 18, "chair": 19, "handle": 20, "nose": 21, "arm": 22, "plate": 23, "stripe": 24, "jacket": 25, "hat": 26, "tail": 27, "foot": 28, "face": 29, "tile": 30, "number": 31, "short": 32, "spot": 33, "bag": 34, "boy": 35, "helmet": 36, "bottle": 37, "glass": 38, "tire": 39, "logo": 40, "boat": 41, "umbrella": 42, "picture": 43, "girl": 44, "button": 45, "mouth": 46, "part": 47, "bird": 48, "box": 49, "banana": 50, "cap": 51, "jean": 52, "glasses": 53, "bench": 54, "book": 55, "top": 56, "clock": 57, "glove": 58, "bowl": 59, "trunk": 60, "bus": 61, "neck": 62, "edge": 63, "train": 64, "reflection": 65, "horse": 66, "paper": 67, "writing": 68, "kite": 69, "flag": 70, "seat": 71, "house": 72, "wing": 73, "board": 74, "lamp": 75, "cup": 76, "elephant": 77, "coat": 78, "giraffe": 79, "sock": 80, "cow": 81, "word": 82, "finger": 83, "dog": 84, "wire": 85, "sheep": 86, "zebra": 87, "ball": 88, "frame": 89, "back": 90, "skateboard": 91, "motorcycle": 92, "container": 93, "windshield": 94, "cat": 95, "towel": 96, "knob": 97, "boot": 98, "bed": 99, "sink": 100, "paw": 101, "surfboard": 102, "horn": 103, "pizza": 104, "bear": 105, "orange": 106, "engine": 107, "photo": 108, "hole": 109, "child": 110, "player": 111, "stand": 112, "mirror": 113, "lady": 114, "vehicle": 115, "sticker": 116, "pot": 117, "apple": 118, "basket": 119, "plane": 120, "key": 121, "tie": 122, "animal": 123, "pole": 124, "bike": 125, "truck": 126, "sunglass": 127, "design": 128, "window": 129, "tree": 130, "wall": 131, "building": 132, "ground": 133, "sky": 134, "leaf": 135, "grass": 136, "cloud": 137, "water": 138, "fence": 139, "rock": 140, "road": 141, "sidewalk": 142, "snow": 143, "bush": 144, "street": 145, "field": 146, "background": 147, "roof": 148, "post": 149, "branch": 150, "dirt": 151, "mountain": 152, "hill": 153, "ski": 154, "beach": 155, "wood": 156, "stone": 157, "ocean": 158, "wave": 159, "ceiling": 160, "floor": 161, "light": 162, "shadow": 163, "sand": 164, "brick": 165, "flower": 166, "track": 167, "pillow": 168, "headlight": 169, "cabinet": 170, "railing": 171, "food": 172, "counter": 173, "people": 174, "curtain": 175, "shelf": 176, "table": 177, "plant": 178}, "object_idx_to_name": ["__image__", "man", "shirt", "person", "sign", "head", "leg", "hand", "hair", "car", "woman", "ear", "eye", "line", "shoe", "door", "wheel", "letter", "pant", "chair", "handle", "nose", "arm", "plate", "stripe", "jacket", "hat", "tail", "foot", "face", "tile", "number", "short", "spot", "bag", "boy", "helmet", "bottle", "glass", "tire", "logo", "boat", "umbrella", "picture", "girl", "button", "mouth", "part", "bird", "box", "banana", "cap", "jean", "glasses", "bench", "book", "top", "clock", "glove", "bowl", "trunk", "bus", "neck", "edge", "train", "reflection", "horse", "paper", "writing", "kite", "flag", "seat", "house", "wing", "board", "lamp", "cup", "elephant", "coat", "giraffe", "sock", "cow", "word", "finger", "dog", "wire", "sheep", "zebra", "ball", "frame", "back", "skateboard", "motorcycle", "container", "windshield", "cat", "towel", "knob", "boot", "bed", "sink", "paw", "surfboard", "horn", "pizza", "bear", "orange", "engine", "photo", "hole", "child", "player", "stand", "mirror", "lady", "vehicle", "sticker", "pot", "apple", "basket", "plane", "key", "tie", "animal", "pole", "bike", "truck", "sunglass", "design", "window", "tree", "wall", "building", "ground", "sky", "leaf", "grass", "cloud", "water", "fence", "rock", "road", "sidewalk", "snow", "bush", "street", "field", "background", "roof", "post", "branch", "dirt", "mountain", "hill", "ski", "beach", "wood", "stone", "ocean", "wave", "ceiling", "floor", "light", "shadow", "sand", "brick", "flower", "track", "pillow", "headlight", "cabinet", "railing", "food", "counter", "people", "curtain", "shelf", "table", "plant"], "attribute_name_to_idx": {"white": 0, "black": 1, "green": 2, "blue": 3, "red": 4, "brown": 5, "yellow": 6, "small": 7, "large": 8, "wooden": 9, "gray": 10, "silver": 11, "metal": 12, "orange": 13, "grey": 14, "tall": 15, "long": 16, "dark": 17, "pink": 18, "standing": 19, "clear": 20, "white ": 21, "round": 22, "tan": 23, "here": 24, "wood": 25, "glass": 26, "open": 27, "purple": 28, "big": 29, "short": 30, "plastic": 31, "parked": 32, "sitting": 33, "walking": 34, "black ": 35, "striped": 36, "young": 37, "brick": 38, "gold": 39, "empty": 40, "hanging": 41, "old": 42, "on": 43, "blue ": 44, "bright": 45, "concrete": 46, "cloudy": 47, "green ": 48, "colorful": 49, "one": 50, "beige": 51, "bare": 52, "wet": 53, "closed": 54, "square": 55, "light": 56, "stone": 57, "little": 58, "blonde": 59, "shiny": 60, "red ": 61, "dirty": 62, "thin": 63, "smiling": 64, "painted": 65, "flying": 66, "brown ": 67, "thick": 68, "sliced": 69, "playing": 70, "calm": 71, "looking": 72, "distant": 73, "tennis": 74, "part": 75, "leather": 76, "dry": 77, "rectangular": 78, "grassy": 79}, "attribute_idx_to_name": ["white", "black", "green", "blue", "red", "brown", "yellow", "small", "large", "wooden", "gray", "silver", "metal", "orange", "grey", "tall", "long", "dark", "pink", "standing", "clear", "white ", "round", "tan", "here", "wood", "glass", "open", "purple", "big", "short", "plastic", "parked", "sitting", "walking", "black ", "striped", "young", "brick", "gold", "empty", "hanging", "old", "on", "blue ", "bright", "concrete", "cloudy", "green ", "colorful", "one", "beige", "bare", "wet", "closed", "square", "light", "stone", "little", "blonde", "shiny", "red ", "dirty", "thin", "smiling", "painted", "flying", "brown ", "thick", "sliced", "playing", "calm", "looking", "distant", "tennis", "part", "leather", "dry", "rectangular", "grassy"], "pred_name_to_idx": {"__in_image__": 0, "on": 1, "next to": 2, "has": 3, "parked on": 4, "by": 5, "with": 6, "along": 7, "against": 8, "in": 9, "under": 10, "of": 11, "wearing": 12, "sitting in": 13, "wears": 14, "beside": 15, "walking on": 16, "at": 17, "on top of": 18, "behind": 19, "made of": 20, "have": 21, "near": 22, "sitting on": 23, "hanging on": 24, "in front of": 25, "carrying": 26, "above": 27, "over": 28, "and": 29, "on side of": 30, "riding": 31, "inside": 32, "attached to": 33, "around": 34, "holding": 35, "standing on": 36, "laying on": 37, "for": 38, "below": 39, "standing in": 40, "covering": 41, "covered in": 42, "belonging to": 43, "eating": 44, "looking at": 45}, "pred_idx_to_name": ["__in_image__", "on", "next to", "has", "parked on", "by", "with", "along", "against", "in", "under", "of", "wearing", "sitting in", "wears", "beside", "walking on", "at", "on top of", "behind", "made of", "have", "near", "sitting on", "hanging on", "in front of", "carrying", "above", "over", "and", "on side of", "riding", "inside", "attached to", "around", "holding", "standing on", "laying on", "for", "below", "standing in", "covering", "covered in", "belonging to", "eating", "looking at"]}
